#step 1:- ஓபன் தமிழ் பைத்தான் அகராதியை நிறுவுதல்
import tamil
#step 2:- ஒரு சொல்லைப் பெற்று ஆய்வு செய்வு செய்யும் நுட்பத்தைச் சேர்த்துக் கொள்ளுங்கள்
நிலைமொழி = input ("ஆய்வு செய்யும் நிலைமொழிச் சொல் ஒன்றினைத் தரவும் : ")
வருமொழி = input ("ஆய்வு செய்யும் வருமொழிச் சொல் ஒன்றினைத் தரவும் : ")
# step 3:-ஆய்விற்காக வாங்கப்பெறும் நிலைமொழிச் சொல் அடைமொழிச் சொல்லுடன் வந்தால் அதனைத் தனித்தனியாகப் பிரிக்க வேண்டும்.

# step 3.1:- அடைமொழிகான சொற்பட்டியலை (உம்மைத்தொகை, இருபெயரொட்டுப் பண்புத்தொகை) வைத்து எழுதுதல் வேண்டும்.

# step 3.2:- நிலைமொழிச் சொல் ம் என முடிந்தால், அதை அந்த எழுத்தை நீக்கவேண்டும்.

def punarchi_rule1 (நிலைமொழி, வருமொழி):
	நிமொஎழுத்து = tamil.utf8.get_letters(நிலைமொழி)
	வமொஎழுத்து = tamil.utf8.get_letters(வருமொழி)
	#print(நிமொஎழுத்து[-1])

	if நிமொஎழுத்து[-1]=="ம்":
		if வமொஎழுத்து[0]:
			வருமொழிபிரி=tamil.utf8.splitMeiUyir(வமொஎழுத்து[0])
			#print (வருமொழிபிரி)
			if வருமொழிபிரி[0] in ['க்', 'ச்', 'த்','ப்']:
				தீர்வு = "".join(நிமொஎழுத்து[0:-1])+ வருமொழிபிரி[0] + ' ' + வருமொழி
				#print (தீர்வு)
				return (தீர்வு)
				
print (punarchi_rule1 (நிலைமொழி, வருமொழி))

#step 4:- பிரித்தவற்றைத் தனியாக ஒரு மாறியில் சேமிக்க வேண்டும்.

#step 5:- சேமித்த மாறியில் உள்ள தரவில் "ம்" இருக்கின்றதா எனப் பார்க்கவேண்டும்.

#step 6:- அடுத்து, உள்ளீடாக வாங்கப்பெற்ற வருமொழிச் சொல்லின் முதல் எழுத்து [0] க, ச, த, ப வரிசைச் சொல்லாக இருக்கின்றதா எனப் பார்க்கவேண்டும்.

#step 7:- க, ச, த, ப வரிசைச் சொற்களாக இருந்தால் நிலைமொழிச் சொல்லின் 'ம்' [ -1] எழுத்தினை நீக்க வேண்டும்.

#step 8:- நீக்கிய பின்பு வருமொழிச்சொல்லின் முதல் எழுத்தின் மெய்யெழுத்தை நிலைமொழிச் சொல்லுடன் சேர்க்க வேண்டும்.

#step 9:- இப்பொழுது நிலைமொழியும் + வருமொழியும் இணையும் சொல்லாக மாற வேண்டும். அந்த இரண்டு சொற்களின் இடையில் இடைவெளி இருக்க வேண்டும். 
##ஆனால், நிலைமொழியின் இறுதியில் [ -1]  வருமொழி முதல் எழுத்தின் [0] ஒலிப்புடைய மெய்யெழுத்து (க், ச், த், ப் ) இடம் பெறுதல் வேண்டும்.

#step 10:- அதன் விளைவு (output) காட்டப்படுதல் வேண்டும். 

#1. பனை (அடைமொழி) மரம் + கிளை
#2. பனைமர + கிளை
#3. பனைமரக் கிளை
