#step 1:- ஓபன் தமிழ் பைத்தான் அகராதியை நிறுவுதல்
import tamil
#step 2:- ஒரு சொல்லைப் பெற்று ஆய்வு செய்வு செய்யும் நுட்பத்தைச் சேர்த்துக் கொள்ளுங்கள்

நிலைமொழி = input ("ஆய்வு செய்யும் நிலைமொழிச் சொல் ஒன்றினைத் தரவும் : ")
வருமொழி = input ("ஆய்வு செய்யும் வருமொழிச் சொல் ஒன்றினைத் தரவும் : ")

# step 3:-ஆய்விற்காக வாங்கப்பெறும் நிலைமொழிச் சொல்லில்  'ஐ', 'ஆல்', 'கு', 'இன்', 'அது', 'கண்' என முடிந்தால் அது வேற்றுமை உருபு ஏற்ற பெயர்ச் சொல் ஆகும். 
		# அந்தச் சொல்லிற்குப் பின்பு வருமொழிச் சொல் க, ச, த, ப வரிசையுடைய வந்தால் வல்லினம் மிகும்.

# step 3.1:- நிலைமொழிச் சொல் ('ஐ', 'ஆல்', 'கு', 'இன்', 'அது', 'கண்') என முடியும் சொல்லா எனப் பார்க்கவேண்டும். 
#			அதற்கு வேற்றுமை உருபுகள் கொண்ட ஒரு பட்டியலை மாறியில் சேமிக்க வேண்டும்.

வேற்றுமைஉருபுகள் = ('ஐ', 'ஆல்', 'கு', 'இன்', 'அது', 'கண்')

# நிலைமொழிச் சொல்லில் அந்த வேற்றுமை உருபு இருக்கின்றாதா எனப் பார்க்கவேண்டும்.

def punarchi_rule2 (நிலைமொழி, வருமொழி):
	நிமொஎழுத்து = tamil.utf8.get_letters(நிலைமொழி)
	வமொஎழுத்து = tamil.utf8.get_letters(வருமொழி)
	#print(நிமொஎழுத்து[-1])

	if நிமொஎழுத்து[-1] in வேற்றுமைஉருபுகள்:
		if வமொஎழுத்து[0]:
			வருமொழிபிரி=tamil.utf8.splitMeiUyir(வமொஎழுத்து[0])
			#print (வருமொழிபிரி)
			if வருமொழிபிரி[0] in ['க்', 'ச்', 'த்','ப்']:
				தீர்வு = "".join(நிமொஎழுத்து[0:-1])+ வருமொழிபிரி[0] + ' ' + வருமொழி
				#print (தீர்வு)
				return (தீர்வு)
				
print (punarchi_rule2 (நிலைமொழி, வருமொழி))

#step 4:- வேற்றுமை உருபு இருந்தது என்றால் வருமொழிச் சொல் க, ச, த, ப வரிசைச் சொற்களாக இருக்கின்றாதா எனப் பார்க்க வேண்டும்.

#step 8:- இருந்தால் வருமொழிச்சொல்லின் முதல் எழுத்தின் மெய்யெழுத்தை நிலைமொழிச் சொல்லுடன் சேர்க்க வேண்டும்.

#step 9:- இப்பொழுது நிலைமொழியும் + வருமொழியும் இணையும் சொல்லாக மாற வேண்டும். அந்த இரண்டு சொற்களின் இடையில் இடைவெளி இருக்க வேண்டும். 
##ஆனால், நிலைமொழியின் இறுதியில் [ -1]  வருமொழி முதல் எழுத்தின் [0] ஒலிப்புடைய மெய்யெழுத்து (க், ச், த், ப் ) இடம் பெறுதல் வேண்டும்.

#step 10:- அதன் விளைவு (output) காட்டப்படுதல் வேண்டும். 

#1. ஊருக்கு + சென்றான்
#2. ஊருக்குச் சென்றான்
