import tamil
import collections
import codecs
import os
import sys

#change this to enable print statements
_DEBUG=False

#http://www.tamilvu.org/courses/degree/c021/c0214/html/c0214661.htm
BASE_DIRECTORY = os.path.split(__file__)[0]

#step 2:- ஒரு சொல்லைப் பெற்று ஆய்வு செய்வு செய்யும் நுட்பத்தைச் சேர்த்துக் கொள்ளுங்கள்
பெயர் = input("ஆய்வு செய்யும் பெயர்ச் சொல் ஒன்றினைத் தரவும் : ")

#கிளவியாக்கம்
#step 3:- உயர்திணைச் சொல்லிற்கான விதி எழுதவேண்டும்
def uyarthinai(பெயர்):
    உயர்திணை_ஆண்பால்_ஈறு = ['ன்']
    உயர்திணை_பெண்பால்_ஈறு = ['ள்']
    உயர்திணை_பலர்பால்_ஈறு = ['ர்', 'ப', 'மார்']  # பலர்பால் ஈறுகளை சேர்த்தல்

    பெயர்_பிரி1 = tamil.utf8.get_letters(பெயர்)
    உயர்_இறுதி_எழுத்து = பெயர்_பிரி1[-1]

    if உயர்_இறுதி_எழுத்து in உயர்திணை_ஆண்பால்_ஈறு or உயர்திணை_பெண்பால்_ஈறு or உயர்திணை_பலர்பால்_ஈறு:
        return True
    else:
        return False

விளைவு1 = uyarthinai(பெயர்)
print(பெயர், "என்பது உயர்திணைச் சொல்லா?" , விளைவு1)

#step 4:- அஃறிணைச் சொல்லிற்கான விதி எழுதவேண்டும்
அஃறிணை_பால் = ['ஒன்றன்பால்', 'பலவின்பால்']

def akrinai(பெயர்):
	அஃறிணை_ஒன்றன்பால்_ஈறு = ['து', 'று', 'டு']
	அஃறிணை_பலவின்பால்_ஈறு = ['அ', 'ஆ', 'வ']
	
	பெயர்_பிரி2 = tamil.utf8.get_letters(பெயர்)
	அஃறி_இறுதி_எழுத்து = பெயர்_பிரி2[-1]
	
	if அஃறி_இறுதி_எழுத்து in அஃறிணை_ஒன்றன்பால்_ஈறு or அஃறிணை_பலவின்பால்_ஈறு:
		return True
	else:
		return False

விளைவு2 = akrinai(பெயர்)
print(பெயர், "என்பது அஃறிணைச் சொல்லா?" , விளைவு2)

#வேற்றுமையியல்
#step 5:- வேற்றுமை உருபிற்கு விதி எழுதவேண்டும்
#வேற்றுமை_உருபு = ['ஐ', 'ஒடு', 'கு', 'இன்', 'அது', 'கண்']
#
#def vetrumai(பெயர்):
#	#முதல்வேற்றுமை = பெயர்
#	இரண்டாம்வேற்றுமை = ['ஐ']
#	மூன்றாம்வேற்றுமை = ['ஒடு']
#	நான்காம்வேற்றுமை = ['கு']
#	ஐந்தாம்வேற்றுமை = ['இன்']
#	ஆறாம்வேற்றுமை = ['அது']
#	ஏழாம்வேற்றுமை = ['கண்']
	#எட்டாம்வேற்றுமை = விளி
#மேலே எழுதிய உயர்திணை, அஃறிணை சொற்களின் பின்பு வேற்றுமை உருபு வரும். அதற்கு விதி எழுத வேண்டும்.	
#	பெயர்_பிரி3 = tamil.utf8.get_letters(பெயர்)
#	வேற்றுமை_இறுதி_எழுத்து = பெயர்_பிரி3[-1]
#	
#	if வேற்றுமை_இறுதி_எழுத்து in உயர்திணை_ஆண்பால்_ஈறு or உயர்திணை_பெண்பால்_ஈறு or உயர்திணை_பலர்பால்_ஈறு or அஃறிணை_ஒன்றன்பால்_ஈறு or அஃறிணை_பலவின்பால்_ஈறு:
#		if வேற்றுமைசேர் in இரண்டாம்வேற்றுமை or மூன்றாம்வேற்றுமை or நான்காம்வேற்றுமை or ஐந்தாம்வேற்றுமை or ஆறாம்வேற்றுமை or ஏழாம்வேற்றுமை:
#			வேற்றுமையேற்றசொல்= பெயர்.join(வேற்றுமைசேர்)
#			return True
#		else:
#			return False
#
#விளைவு3 = vetrumai(பெயர்)
#print(பெயர், "என்பது அஃறிணைச் சொல்லா?" , விளைவு3)

பெயர் = input("ஆய்வு செய்யும் பெயர்ச் சொல் ஒன்றினைத் தரவும் : ")

def vetrumai(பெயர், வேற்றுமைசேர்):
    வேற்றுமை_உருபுகள் = ['ஐ', 'ஒடு', 'கு', 'இன்', 'அது', 'கண்']

    if வேற்றுமைசேர் in வேற்றுமை_உருபுகள்:
        வேற்றுமையேற்றசொல் = பெயர் + வேற்றுமைசேர்
        return வேற்றுமையேற்றசொல்
    else:
        return "தவறான வேற்றுமை உருபு"

விளைவு3 = vetrumai(வேற்றுமையேற்றசொல்)
print(விளைவு3)


#step 6:- உயர்திணைச் சொல்லிற்கான விதி எழுதவேண்டும்
ஓரெழுத்தொருமொழி=['ஆ', 'ஈ', 'ஊ', 'ஏ', 'ஐ', 'ஓ', 'கா', 'கூ', 'கை', 'கோ', 'சா', 'சீ', 'சே', 'சோ', 'தா', 'தீ', 'து', 'தூ', 'தே', 'தை', 'நா', 'நீ', 'நே', 'நை', 'நொ', 'நோ', 'பா', 'பூ', 'பே', 'பை', 'போ', 'மா', 'மீ', 'மூ', 'மே', 'மை', 'மோ', 'யா', 'வா', 'வீ', 'வை', 'வௌ']
சுட்டு=['அ','இ','உ']
வினா=['ஆ','ஏ','ஓ']
எண்கள்_எழுத்தில்=['ஒன்று','இரண்டு','மூன்று','நான்கு','ஐந்து','ஆறு','ஏழு','ஒன்பது','நூறு','ஒரு','இரு','அறு','எழு']
வியங்கோள்=['க', 'இய', 'இயர்'] # ஒரு சொல்லின் இறுதியில் இந்த வடிவம் வரும்.


