import tamil


def uyarthinai(பெயர்):
    உயர்திணை_ஆண்பால்_ஈறு = ['ன்']
    உயர்திணை_பெண்பால்_ஈறு = ['ள்']
    உயர்திணை_பலர்பால்_ஈறு = ['ர்', 'ப', 'மார்']  # பலர்பால் ஈறுகளை சேர்த்தல்

    உயர்திணை_ஈறு = ['ன்','ள்','ர்', 'ப', 'மார்']

    பெயர்_பிரி1 = tamil.utf8.get_letters(பெயர்)
    உயர்_இறுதி_எழுத்து = பெயர்_பிரி1[-1]

    #if உயர்_இறுதி_எழுத்து in உயர்திணை_ஆண்பால்_ஈறு or உயர்திணை_பெண்பால்_ஈறு or \
    #  உயர்திணை_பலர்பால்_ஈறு:
    #    return ('ஆம். இது உயர்திணைச் சொல்தான்')
    if  உயர்_இறுதி_எழுத்து in உயர்திணை_ஈறு:
       return ('ஆம். இது உயர்திணைச் சொல்தான்')
    else:
        return ('இல்லை. இது உயர்திணைச் சொல் இல்லை. வேறு ஒரு சொல்லினைத் தந்து ஆய்வு செய்க.')


#விளைவு1 = uyarthinai(பெயர்)
#print(பெயர், "என்பது உயர்திணைச் சொல்லா?" , விளைவு1)
##step 2:- ஒரு சொல்லைப் பெற்று ஆய்வு செய்வு செய்யும் நுட்பத்தைச் சேர்த்துக் கொள்ளுங்கள்
#பெயர் = input("ஆய்வு செய்யும் பெயர்ச் சொல் ஒன்றினைத் தரவும் : ")
#
#அஃறிணை_பால் = ['ஒன்றன்பால்', 'பலவின்பால்']
#
#விளைவு2 = akrinai(பெயர்)
#print(பெயர், "என்பது அஃறிணைச் சொல்லா?" , விளைவு2)
#