import tamil

உயிரெழுத்துகள் = ["அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ"]
மெய்யெழுத்துகள் = ["க்","ங்","ச்","ஞ்","ட்","ண்","த்","ந்","ப்","ம்","ய்","ர்","ல்","வ்","ழ்","ள்","ற்","ன்"]

வல்லெழுத்துகள் = ["க்","ச்","ட்","த்","ப்","ற்"]

மெல்லெழுத்துகள் = ["ங்","ஞ்","ண்","ந்", "ம்","ன்"]

உயிர்மெய்கள் = [
"க","கா","கி","கீ","கு","கூ","கெ","கே","கை","கொ","கோ","கௌ",
"ங","ஙா","ஙி","ஙீ","ஙு","ஙூ","ஙெ","ஙே","ஙை","ஙொ","ஙோ","ஙௌ",
"ச","சா","சி","சீ","சு","சூ","செ","சே","சை","சொ","சோ","சௌ",
"ஞ","ஞா","ஞி","ஞீ","ஞு","ஞூ","ஞெ","ஞே","ஞை","ஞொ","ஞோ","ஞௌ",
"ட","டா","டி","டீ","டு","டூ","டெ","டே","டை","டொ","டோ","டௌ",
"ண","ணா","ணி","ணீ","ணு","ணூ","ணெ","ணே","ணை","ணொ","ணோ","ணௌ",
"த","தா","தி","தீ","து","தூ","தெ","தே","தை","தொ","தோ","தௌ",
"ந","நா","நி","நீ","நு","நூ","நெ","நே","நை","நொ","நோ","நௌ",
"ப","பா","பி","பீ","பு","பூ","பெ","பே","பை","பொ","போ","பௌ",
"ம","மா","மி","மீ","மு","மூ","மெ","மே","மை","மொ","மோ","மௌ",
"ய","யா","யி","யீ","யு","யூ","யெ","யே","யை","யொ","யோ","யௌ",
"ர","ரா","ரி","ரீ","ரு","ரூ","ரெ","ரே","ரை","ரொ","ரோ","ரௌ",
"ல","லா","லி","லீ","லு","லூ","லெ","லே","லை","லொ","லோ","லௌ",
"வ","வா","வி","வீ","வு","வூ","வெ","வே","வை","வொ","வோ","வௌ",
"ழ","ழா","ழி","ழீ","ழு","ழூ","ழெ","ழே","ழை","ழொ","ழோ","ழௌ",
"ள","ளா","ளி","ளீ","ளு","ளூ","ளெ","ளே","ளை","ளொ","ளோ","ளௌ",
"ற","றா","றி","றீ","று","றூ","றெ","றே","றை","றொ","றோ","றௌ",
"ன","னா","னி","னீ","னு","னூ","னெ","னே","னை","னொ","னோ","னௌ"
]
 
def எழுத்துகள்(மொழி):
    return tamil.utf8.get_letters(மொழி)

def வகை(எழுத்து):
    if எழுத்து in உயிரெழுத்துகள்:
        return {
            'வகை':"உயிர்",
            'எழுத்து':எழுத்து,
            'உயிர்':எழுத்து,
            'மெய்': None,
            }
    elif எழுத்து in மெய்யெழுத்துகள்:
        return {
            'வகை':"மெய்",
            'எழுத்து':எழுத்து,
            'உயிர்':None,
            'மெய்':எழுத்து
            }
    elif எழுத்து in உயிர்மெய்கள்:
        உயிர்மெய் = tamil.utf8.splitMeiUyir(எழுத்து)
        return {
            'வகை':"உயிர்மெய்",
            'எழுத்து':எழுத்து,
            'உயிர்':உயிர்மெய்[1],
            'மெய்':உயிர்மெய்[0]
        }
    else:
        return {}

def தம்மினம்( உள்ளீடு ):
    for இனம் , மெய் in zip(மெல்லெழுத்துகள்,வல்லெழுத்துகள்):
        if உள்ளீடு == மெய்:
            return இனம்

def உயிர்மெய்யாதல்(உயிர்,மெய்):
    return [tamil.utf8.joinMeiUyir(உயிர்,மெய்)]

def உயிர்நீங்கள்(உயிர்மெய்):
    return [tamil.utf8.splitMeiUyir(உயிர்மெய்)[0]]

def மெய்நீங்கள்(உயிர்மெய்):
    return [tamil.utf8.splitMeiUyir(உயிர்மெய்)[1]]
