from . import மொழிமரபு
from . நூல்மரபு import மெல்லெழுத்துகள் , தம்மினம், வல்லெழுத்துகள்,உயிர்மெய்யாதல்,\
  உயிர்நீங்கள்,மெய்யெழுத்துகள்,உயிரெழுத்துகள்,மெய்நீங்கள்,வகை

class புணர்ச்சி:
  def __init__(self, மொழி):
    self.மொழி = மொழிமரபு.மரபு(மொழி)
    self.இடம் = 0
    self.நிலைமொழி = {}
    self.வருமொழி =  {}
    self.சாரியை =  {}
    self.வேற்றுமை = {}
    self.சரியானவை = []
    self.புணர்தல்வகை = 0

  def அடுத்தச்சொல்(self):
    self.இடம் = self.இடம் + 1
    return self.இடம்

  def விதிகள்(self):
    self.நிலைமொழி = self.மொழி[self.இடம்]
    self.வருமொழி = self.மொழி[self.அடுத்தச்சொல்()] 
    if 'வேற்றுமை உருபு' in self.வருமொழி['இலக்கனம்']:
      self.வேற்றுமை =  self.வருமொழி 
      self.சரியானவை.append( self.வேற்றுமைபுணர்ச்சி() )
    elif 'சாரியை உருபு' in self.வருமொழி['இலக்கனம்']:
      self.சாரியை = self.வருமொழி
      self.வருமொழி = self.மொழி[self.அடுத்தச்சொல்()] 
      self.சரியானவை.append( self.சாரியைப்புணர்ச்சி() )
      print()
    else:
      print('##'*20)
    return self.சரியானவை

  def வேற்றுமைபுணர்ச்சி(self):  
    if self.நிலைமொழி['மொழியிறுதி']['வகை'] == 'மெய்':
      
      if self.நிலைமொழி['மொழியிறுதி']['எழுத்து'] in மெல்லெழுத்துகள்:
        self.நிலைமொழி['எழுத்துகள்'][-1] = தம்மினம்(self.வேற்றுமை['மொழிமுதல்']['மெய்'] )
        return ''.join(self.நிலைமொழி['எழுத்துகள்']) + self.வேற்றுமை['மொழி']
 
      elif self.வேற்றுமை['மொழிமுதல்']['மெய்'] in வல்லெழுத்துகள்:
        self.நிலைமொழி['எழுத்துகள்'] = self.நிலைமொழி['எழுத்துகள்'] + [self.வேற்றுமை['மொழிமுதல்']['மெய்']]
        return ''.join(self.நிலைமொழி['எழுத்துகள்']) + self.வேற்றுமை['மொழி']
 
  def சாரியைப்புணர்ச்சி(self):  
    if self.சாரியை['மொழி'] == 'இன்':  
      if self.நிலைமொழி['மொழியிறுதி']['உயிர்'] == 'ஆ' and self.சாரியை['மொழிமுதல்']['வகை'] == 'உயிர்':
        self.கெடுதல்(மொழி='சாரியை',எங்கு='மொழிமுதல்',வகை='ஒரு எழுத்து கெடுகம்')
      if 'அளவைக்குறிக்கும் சொல்' in self.வருமொழி['இலக்கனம்']:   
        self.திரிதல்(மொழி='சாரியை',எங்கு='மொழிமுதல்',திரிபு='ற்',வகை='உயிர்நீங்கள்')         
      if self.வருமொழி['மொழி'] == 'கு':
        self.திரிதல்(மொழி='சாரியை',எங்கு='மொழியிறுதி',திரிபு='ற்',வகை='வேறேழுத்து') 
      
    elif self.சாரியை['மொழி'] == 'வற்று':
      if 'சுட்டு சொல்' in self.நிலைமொழி['இலக்கனம்'] : 
        self.திரிதல்(மொழி='சாரியை',எங்கு='மொழிமுதல்',திரிபு='அ',வகை='வேறேழுத்து')   
      
    elif self.சாரியை['மொழி'] == 'ஆன்':
      self.திரிதல்(மொழி='சாரியை',எங்கு='மொழியிறுதி',திரிபு='ற்',வகை='வேறேழுத்து')
    elif self.சாரியை['மொழி'] == 'அத்து':
      pass
    elif self.சாரியை['மொழி'] ==  'இக்கு':
      self.கெடுதல்(மொழி='சாரியை',எங்கு='மொழிமுதல்',வகை='ஒரு எழுத்து கெடுகம்')
      self.கெடுதல்(மொழி='சாரியை',எங்கு='மொழியிறுதி',வகை='ஒரு எழுத்து கெடுகம்')
    elif self.சாரியை['மொழி'] ==  'அக்கு':
      self.கெடுதல்(மொழி='சாரியை',எங்கு='மொழிமுதல்',வகை='பிற எழுத்துக்கள் கெடுகம்')
    elif self.சாரியை['மொழி'] ==  'அம்':
      pass
    self.குற்றியலுகரயீறு()
    self.உயிர்வரின்()
    #print(self.நிலைமொழி['எழுத்துகள்'],self.சாரியை['எழுத்துகள்'],self.வருமொழி['எழுத்துகள்'])
    self.புணர்தல்()

  def குற்றியலுகரயீறு(self):
    if self.நிலைமொழி['மொழியிறுதி']['உயிர்'] == 'உ':
      if வகை(self.நிலைமொழி['எழுத்துகள்'][-2])['வகை'] == 'உயிர்':
        pass
      if வகை(self.நிலைமொழி['எழுத்துகள்'][-2])['வகை'] == 'உயிர்':
        pass
      if self.சாரியை['மொழிமுதல்']['வகை'] == 'உயிர்': 
        self.நிலைமொழி['எழுத்துகள்'] = self.நிலைமொழி['எழுத்துகள்'][:-1] +  உயிர்நீங்கள்( self.சாரியை['எழுத்துகள்'][-1] )
    
    if self.சாரியை['மொழியிறுதி']['உயிர்'] == 'உ' and self.வருமொழி['மொழிமுதல்']['வகை'] == 'உயிர்':
      self.சாரியை['எழுத்துகள்'] = self.சாரியை['எழுத்துகள்'][:-1] +  உயிர்நீங்கள்( self.சாரியை['எழுத்துகள்'][-1] )

  def உயிர்வரின்(self):
    if self.சாரியை['மொழிமுதல்']['உயிர்'] in ['இ','ஈ','ஐ'] :
      self.நிலைமொழி['எழுத்துகள்'] = self.நிலைமொழி['எழுத்துகள்'] + ['வ்']
    else:
      self.நிலைமொழி['எழுத்துகள்'] = self.நிலைமொழி['எழுத்துகள்'] + ['ய்']
     

  def மிகுதல்(self,மொழி,மிகுவது):
    if மொழி == 'நிலைமொழி':
      self.சாரியை['எழுத்துகள்'] = self.சாரியை['எழுத்துகள்'][:-1]  
    if மொழி == 'சாரியை':
      self.சாரியை['எழுத்துகள்'] = self.சாரியை['எழுத்துகள்'][:-1]  

  def திரிதல்(self,மொழி,எங்கு,திரிபு,வகை): 
    மீதி = 1 if எங்கு == 'மொழிமுதல்' else -1
    if வகை == 'வேறேழுத்து':
      திரிபு = [திரிபு] 
    elif வகை == 'உயிர்நீங்கள்': 
      if மொழி == 'நிலைமொழி':
        திரிபு =  உயிர்நீங்கள்( self.சாரியை['எழுத்துகள்'][0] if மீதி == 0 else self.சாரியை['எழுத்துகள்'][-1] )
      if மொழி == 'சாரியை':
        திரிபு =  உயிர்நீங்கள்( self.சாரியை['எழுத்துகள்'][0] if மீதி == 1 else self.சாரியை['எழுத்துகள்'][-1] )
    if மொழி == 'சாரியை':
      if எங்கு == 'மொழிமுதல்': 
        self.சாரியை['எழுத்துகள்'] =  திரிபு + self.சாரியை['எழுத்துகள்'][மீதி:] 
      if எங்கு == 'மொழியிறுதி': 
        self.சாரியை['எழுத்துகள்'] = self.சாரியை['எழுத்துகள்'][:மீதி] + திரிபு
    if மொழி ==  'நிலைமொழி':
      if எங்கு == 'மொழிமுதல்': 
        self.சாரியை['எழுத்துகள்'] =  திரிபு + self.சாரியை['எழுத்துகள்'][மீதி:] 
      if எங்கு == 'மொழியிறுதி': 
        self.சாரியை['எழுத்துகள்'] = self.சாரியை['எழுத்துகள்'][:மீதி] + [திரிபு]
     
  def கெடுதல்(self,மொழி,எங்கு,வகை): 
    மீதி = 1 if எங்கு == 'மொழிமுதல்' else -1
    if வகை == 'ஒரு எழுத்து கெடுகம்':
      if மொழி == 'சாரியை':
        if எங்கு == 'மொழிமுதல்': 
          self.சாரியை['எழுத்துகள்'] =  self.சாரியை['எழுத்துகள்'][மீதி:] 
        if எங்கு == 'மொழியிறுதி': 
          self.சாரியை['எழுத்துகள்'] = self.சாரியை['எழுத்துகள்'][:மீதி]
      if மொழி ==  'நிலைமொழி':
        if எங்கு == 'மொழிமுதல்': 
          self.சாரியை['எழுத்துகள்'] =  self.சாரியை['எழுத்துகள்'][மீதி:] 
        if எங்கு == 'மொழியிறுதி': 
          self.சாரியை['எழுத்துகள்'] = self.சாரியை['எழுத்துகள்'][:மீதி] 
    elif வகை == 'பிற எழுத்துக்கள் கெடுகம்':
      if மொழி == 'சாரியை':
        if எங்கு == 'மொழிமுதல்': 
          self.சாரியை['எழுத்துகள்'] =  self.சாரியை['எழுத்துகள்'][0] 
        if எங்கு == 'மொழியிறுதி': 
          self.சாரியை['எழுத்துகள்'] = self.சாரியை['எழுத்துகள்'][-1]
      if மொழி ==  'நிலைமொழி':
        if எங்கு == 'மொழிமுதல்': 
          self.சாரியை['எழுத்துகள்'] =  self.சாரியை['எழுத்துகள்'][0] 
        if எங்கு == 'மொழியிறுதி': 
          self.சாரியை['எழுத்துகள்'] = self.சாரியை['எழுத்துகள்'][-1] 

  def புணர்தல்(self):
    print("$"*10) 
    புணர்ச்சிசொல் = ''
    if self.நிலைமொழி['எழுத்துகள்'][-1] in  மெய்யெழுத்துகள் and self.சாரியை['எழுத்துகள்'][0] in  உயிரெழுத்துகள்:
      புணர்ச்சிசொல் = புணர்ச்சிசொல் + ''.join(self.நிலைமொழி['எழுத்துகள்'][:-1]) \
          +  ''.join(உயிர்மெய்யாதல்( self.நிலைமொழி['எழுத்துகள்'][-1],  self.சாரியை['எழுத்துகள்'][0]) )

    if self.சாரியை['எழுத்துகள்'][-1] in  மெய்யெழுத்துகள் and self.வருமொழி['எழுத்துகள்'][0] in  உயிரெழுத்துகள்:
      
      புணர்ச்சிசொல் = புணர்ச்சிசொல் + ''.join(self.சாரியை['எழுத்துகள்'][1:-1]) \
          + ''.join( உயிர்மெய்யாதல்( self.சாரியை['எழுத்துகள்'][-1],  self.வருமொழி['எழுத்துகள்'][0]) )
      புணர்ச்சிசொல் = புணர்ச்சிசொல் + ''.join(self.வருமொழி['எழுத்துகள்'][1:])
    else:
      புணர்ச்சிசொல் = புணர்ச்சிசொல் + ''.join(self.சாரியை['எழுத்துகள்'][1:]) +  self.வருமொழி['மொழி']

    return புணர்ச்சிசொல்

 