from . import நூல்மரபு


#,"வற்று","அத்து","அம்","ஒன்","ஆன்","அக்கு","இக்கு",
# "தம்","நம்","நும்","உம்","கெழு","ஏ", "ஐ","ஞான்று"
சாரியை = ["இன்","வற்று","அத்து","அம்","ஆன்","அக்கு","இக்கு",]

வேற்றுமைஉருபுகள் = ['கு', 'அது', 'கண்'] # 'இன்' 'ஐ', 'ஆல்',

அளவைக்குறிக்கும்_சொல் = ['உழக்கு']

சுட்டு_சொல் =  ['அவை']

அஃறிணை_ஒன்றன்பால்_ஈறு = ['து', 'று', 'டு']
அஃறிணை_பலவின்பால்_ஈறு = ['அ', 'ஆ', 'வ']
அஃறிணை_ஈறு = ['து', 'று', 'டு','அ', 'ஆ', 'வ']

உயர்திணை_ஆண்பால்_ஈறு = ['ன்']
உயர்திணை_பெண்பால்_ஈறு = ['ள்']
உயர்திணை_பலர்பால்_ஈறு = ['ர்', 'ப', 'மார்']  # பலர்பால் ஈறுகளை சேர்த்தல்

உயர்திணை_ஈறு = ['ன்','ள்','ர்', 'ப', 'மார்']

def மரபு(சொற்கள்):
    கொடு = []
    for மொழி in சொற்கள்:
        எழுத்துகள் = நூல்மரபு.எழுத்துகள்(மொழி)
        கொடு.append({
            "எழுத்துகள்" : எழுத்துகள்,
            "மொழி" :  மொழி,
            "மொழிமுதல்": நூல்மரபு.வகை( எழுத்துகள்[0] ),
            "மொழியிறுதி": நூல்மரபு.வகை( எழுத்துகள்[-1] ),
            "இலக்கனம்":  இலக்கனக்குறிப்பு(மொழி)
        })
    return கொடு

def இலக்கனக்குறிப்பு( மொழி ):
    if மொழி in சாரியை:
        return ['சாரியை உருபு']
    if மொழி in வேற்றுமைஉருபுகள்:
        return ['வேற்றுமை உருபு']
    if மொழி in அளவைக்குறிக்கும்_சொல்:
        return ['அளவைக்குறிக்கும் சொல்']
    if மொழி in சுட்டு_சொல்:
        return['சுட்டு சொல்']
    else:
        return [None]
    
            


'''
def meymayakkam(மொழி , உ = ['சறிபார்','விதி','மெய்','விளக்கம்',] ):

    விதிகள் =[    ] 

    மொழி=  எழுத்துகள்.மொழி( மொழி ) 
    எண் = 0

    for _ in மொழி:
        if _['type'] == 'மெய்':
            அடுத்து = மொழி[எண்+1]
            if அடுத்து['type'] == 'உயிர்மெய்':
                for விதி in விதிகள்[0:8]:
                    if _['மெய்'] in எழுத்துகள்.எழுத்துகள்( விதி['மெய்'] ):
                        if அடுத்து['மெய்'] in எழுத்துகள்.எழுத்துகள்( விதி['மயக்கம்'] ):
                            return [ _['மெய்'], அடுத்து['மெய்'], விதி["விதி"] ]
                        break
                if _['மெய்'] == அடுத்து['மெய்']:    
                    return [ _['மெய்'], அடுத்து['மெய்'],விதிகள்[8]["விதி"] ]
                
            if _['மெய்'] in எழுத்துகள்.எழுத்துகள்('ய்ர்ழ்') and அடுத்து['type'] == 'மெய்' and அடுத்து['மெய்'] in எழுத்துகள்.எழுத்துகள்('க்ச்த்ப்ங்ஞ்ந்ம்'):
                மூவோற்று = மொழி[எண்+2]
                if மூவோற்று['type'] == 'உயிர்மெய்' and மூவோற்று['மெய்'] in எழுத்துகள்.எழுத்துகள்('க்ச்த்ப்'):
                    return [ _['மெய்'], அடுத்து['மெய்'],மூவோற்று['மெய்'], விதிகள்[9]["விதி"] ]

        எண் = எண்+1
    
'''
